// 1. Создание и рендер разметки по массиву данных galleryItems из app.js и предоставленному шаблону.

// 2. Реализация делегирования на галерее ul.js-gallery и получение url большого изображения.

// 3. Открытие модального окна по клику на элементе галереи.

// 4. Подмена значения атрибута src элемента img.lightbox__image.

// 5. Закрытие модального окна по клику на кнопку button[data-action="close-lightbox"].

// 6. Очистка значения атрибута src элемента img.lightbox__image. 

// 7. Закрытие модального окна по клику на div.lightbox__overlay.

// 8. Закрытие модального окна по нажатию клавиши ESC.

// 9. Пролистывание изображений галереи в открытом модальном окне клавишами "влево" и "вправо".